app/controllers/application_controller.rb

  def set_user
    @user = User.find(session[:id]) if @user.nil? && session[:id]
---
SELECT * FROM "users" WHERE ("users"."id" = 2)