app/controllers/main_page_controller.rb

  def index
    @newsy = News.all(:order => 'created_at DESC')
---
SELECT * FROM "news" ORDER BY created_at DESC

  def calendar
	@terminy = Terminarz.all(:order => 'created_at DESC')
---
SELECT * FROM "terminarzs" ORDER BY created_at DESC