app/controllers/main_page_controller.rb

  def index
    @newsy = News.find(:all)
---
SELECT * FROM "news" WHERE ("news"."id" = 2)