app/controllers/news_controller.rb

SELECT * FROM "news" ORDER BY created_at DESC
---
  def index
    @news = News.all

SELECT * FROM "news" WHERE ("news"."id" = 1)
---
  def show
    @news = News.find(params[:id])

SELECT * FROM "news" WHERE ("news"."id" = 1)
---
  def edit
    @news = News.find(params[:id])

INSERT INTO "news" ("dodane", "created_at", "tresc", "updated_at", "tytul") VALUES('2010-04-11', '2010-04-11 17:59:40', 'pierwszy news', '2010-04-11 17:59:40', 'bla bla bla')
---
  def create
    @news = News.new(params[:news])

    respond_to do |format|
      if @news.save

SELECT * FROM "news" WHERE ("news"."id" = 3)
UPDATE "news" SET "updated_at" = '2010-05-12 16:13:37', "tresc" = 'Juz niedługo do naszej druzyny dołączy jeden z najlepszych 5-ligowych zawodników - Kleofas Gąbka. Kleofas aktuanie gra w klubie Smoki Trąbki Wielki, na pozycji napastnika. Dzieki temu transferowi nasza druzyna ma szanse stac sie najlepszym zespołem VII ligi. Cena transferu to astronomiczne 20zł + 2 wina i paczka papierosów. Czekamy na efekty...' WHERE "id" = 3
---
  def update
    @news = News.find(params[:id])

    respond_to do |format|
      if @news.update_attributes(params[:news])

SELECT * FROM "news" WHERE ("news"."id" = 1)
DELETE FROM "news" WHERE "id" = 1
---
  def destroy
    @news = News.find(params[:id])
    @news.destroy