app/controllers/terminarzs_controller.rb

SELECT * FROM "terminarzs" ORDER BY created_at DESC
---
	def wszystkie
		@termin = Terminarz.all(:order => 'created_at DESC')

INSERT INTO "terminarzs" ("goscie", "created_at", "data_spotkania", "updated_at", "gospodarze", "wynik") VALUES(NULL, '2010-05-14 20:03:53', NULL, '2010-05-14 20:03:53', NULL, NULL)
---
	def zapisz
		Terminarz.create(params[:terminarz])

SELECT * FROM "terminarzs" WHERE ("terminarzs"."id" = 0)
---
	def edytuj
		@termin = Terminarz.find(params[:id])

SELECT * FROM "terminarzs" WHERE ("terminarzs"."id" = 2)
---
	def update
		@termin = Terminarz.find(params[:id])

SELECT * FROM "terminarzs" WHERE ("terminarzs"."id" = 26)
DELETE FROM "terminarzs" WHERE "id" = 26
---
	def usun
		@termin = Terminarz.find(params[:id])
		@termin.destroy